shimjaeyeong/H-TEC/Micrium/Software/EvalBoards/ST/STM3210B-EVAL/IAR/OS-Probe/app.c
/*
 *********************************************************************************************************
 *                                                main()
 *
 * Description : This is the standard entry point for C code.  It is assumed that your code will call
 *               main() once you have performed all necessary initialization.
 *
 * Argument(s) : none.
 *
 * Return(s)   : none.
 *********************************************************************************************************
 */

int main(void)
{
	CPU_INT08U os_err;

	/* Disable all ints until we are ready to accept them.  */
	BSP_IntDisAll();

	/* Initialize "uC/OS-II, The Real-Time Kernel".         */
	OSInit();

	initAll();

	// Create Message Que, msg : 저장공간, 크기 : 10
	//temperQue = (OS_EVENT *)OSQCreate(msg, 10);

	// Create semaphore
	sem = OSSemCreate(0);

	os_err = OSTaskCreateExt((void (*)(void *))detectTask,						   // Task가 수행할 함수, 사람의 존재 유/무를 알려주는 Task
							 (void *)0,											   // Task로 넘겨줄 인자
							 (OS_STK *)&detectTaskStack[TASK_STK_SIZE - 1],		   // Task가 할당될 Stack의 Top을 가리키는 주소
							 (INT8U)TASK_DETECT_PRIO,							   // Task의 우선 순위 (MPT)
							 (INT16U)TASK_DETECT_PRIO,							   // Task를 지칭하는 유일한 식별자, Task 갯수의 극복을 위해서 사용할 예정, 현재는 우선 순위와 같게끔 설정
							 (OS_STK *)&detectTaskStack,						   // Task가 할당될 Stack의 마지막을 가리키는 주소, Stack 검사용으로 사용
							 (INT32U)TASK_STK_SIZE,								   // Task Stack의 크기를 의미
							 (void *)0,											   // Task Control Block 활용시 사용
							 (INT16U)(OS_TASK_OPT_STK_CLR | OS_TASK_OPT_STK_CHK)); // Task 생성 옵션

	os_err = OSTaskCreateExt((void (*)(void *))temperTask, // 사람의 온도를 측정하여 통과할지 말지를 결정하는 Task
							 (void *)0,
							 (OS_STK *)&temperatureTaskStack[TASK_STK_SIZE - 1],
							 (INT8U)TASK_TEMPER_PRIO,
							 (INT16U)TASK_TEMPER_PRIO,
							 (OS_STK *)&temperatureTaskStack,
							 (INT32U)TASK_STK_SIZE,
							 (void *)0,
							 (INT16U)(OS_TASK_OPT_STK_CLR | OS_TASK_OPT_STK_CHK));

	os_err = OSTaskCreateExt((void (*)(void *))passTask, // 정상체온인 사람은 통과를 허가하는 Task
							 (void *)0,
							 (OS_STK *)&passTaskStack[TASK_STK_SIZE - 1],
							 (INT8U)TASK_PASS_PRIO,
							 (INT16U)TASK_PASS_PRIO,
							 (OS_STK *)&passTaskStack,
							 (INT32U)TASK_STK_SIZE,
							 (void *)0,
							 (INT16U)(OS_TASK_OPT_STK_CLR | OS_TASK_OPT_STK_CHK));

	os_err = OSTaskCreateExt((void (*)(void *))denyTask, // 비정상체온인 사람은 통과를 불허하는 Task
							 (void *)0,
							 (OS_STK *)&denyTaskStack[TASK_STK_SIZE - 1],
							 (INT8U)TASK_DENY_PRIO,
							 (INT16U)TASK_DENY_PRIO,
							 (OS_STK *)&denyTaskStack,
							 (INT32U)TASK_STK_SIZE,
							 (void *)0,
							 (INT16U)(OS_TASK_OPT_STK_CLR | OS_TASK_OPT_STK_CHK));

	os_err = OSTaskCreateExt((void (*)(void *))checkTask, // 알림 장치 작동 중지하는 Task
							 (void *)0,
							 (OS_STK *)&checkTaskStack[TASK_STK_SIZE - 1],
							 (INT8U)TASK_CHECK_PRIO,
							 (INT16U)TASK_CHECK_PRIO,
							 (OS_STK *)&checkTaskStack,
							 (INT32U)TASK_STK_SIZE,
							 (void *)0,
							 (INT16U)(OS_TASK_OPT_STK_CLR | OS_TASK_OPT_STK_CHK));

							 for(int i = 0; i < 300000; i++){
			
		}
		GPIO_SetBits(GPIOB, GPIO_Pin_8);
			GPIO_SetBits(GPIOC, GPIO_Pin_10);
			for(int i = 0; i < 300000; i++){
			
		}
		GPIO_ResetBits(GPIOB, GPIO_Pin_8);
			GPIO_ResetBits(GPIOC, GPIO_Pin_10);
			for(int i = 0; i < 300000; i++){
			
		}

/*	os_err = OSTaskCreateExt((void (*)(void *))displayTask, // dot-matrix 표시하는 Task
							 (void *)0,
							 (OS_STK *)&displayTaskStack[TASK_STK_SIZE - 1],
							 (INT8U)TASK_DISPLAY_PRIO,
							 (INT16U)TASK_DISPLAY_PRIO,
							 (OS_STK *)&displayTaskStack,
							 (INT32U)TASK_STK_SIZE,
							 (void *)0,
							 (INT16U)(OS_TASK_OPT_STK_CLR | OS_TASK_OPT_STK_CHK));
*/
#if (OS_TASK_NAME_SIZE >= 11)
	OSTaskNameSet(TASK_DETECT_PRIO, (CPU_INT08U *)"Detect Task", &os_err);
	OSTaskNameSet(TASK_TEMPER_PRIO, (CPU_INT08U *)"Temperature Task", &os_err);
	OSTaskNameSet(TASK_PASS_PRIO, (CPU_INT08U *)"Pass Task", &os_err);
	OSTaskNameSet(TASK_DENY_PRIO, (CPU_INT08U *)"Deny Task", &os_err);
	OSTaskNameSet(TASK_CHECK_PRIO, (CPU_INT08U *)"Check Task", &os_err);
	//OSTaskNameSet(TASK_DISPLAY_PRIO, (CPU_INT08U *)"Display Task", &os_err);
#endif

	OSStart(); /* Start multitasking (i.e. give control to uC/OS-II).  */

	return (0);
}

/*
 *********************************************************************************************************
 *                                          detectTask()
 *
 * Description : Human detecting task. Monitor the existence of people,
 *
 * Argument(s) : p
 *
 * Return(s)   : none.
 *
 * Caller(s)   : This is a task.
 *
 * Note(s)     : none.
 *********************************************************************************************************
 */

// Task가 수행할 함수, 사람의 존재 유/무를 알려주는 Task
static void detectTask(void *p)
{
	CPU_INT08U err;

	while (DEF_TRUE)
	{
		int exist = GPIO_ReadInputDataBit(GPIOB, GPIO_Pin_1);

		

		if (exist != 0) // when human detected
		{
			OSFlagPost(flagGroup, FLAG_DETECT, OS_FLAG_SET, &err);
		}
		else
		{
			OSFlagPost(flagGroup, FLAG_DETECT_NOT, OS_FLAG_SET, &err);
		}
		OSTimeDlyHMSM(0, 0, 0, DELAY_TIME); // To run other tasks
	}
}

/*
 *********************************************************************************************************
 *                                            temperTask()
 *
 * Description : Measure a person's temperature
 *
 * Argument(s) : p
 *
 * Return(s)   : none.
 *
 * Caller(s)   : This is a task.
 *
 * Note(s)     : none.
 *********************************************************************************************************
 */

// 사람의 온도를 측정하여 통과할지 말지를 결정하는 Task
static void temperTask(void *p)
{
	INT8U err;
	int temp;
	int high = 39;
	int low = 34;
	while (DEF_TRUE)
	{
		temp = 50;		 //ADC_GetConversionValue(ADC1) / 50;
		if (temp > high) // when temperature is HIGH
		{
			OSFlagPost(flagGroup, FLAG_TEMPER_HIGH, OS_FLAG_SET, &err);
		}
		else if (temp < low)
		{
			OSFlagPost(flagGroup, FLAG_TEMPER_LOW, OS_FLAG_SET, &err);
		}
		else
		{
			OSFlagPost(flagGroup, FLAG_TEMPER_NORMAL, OS_FLAG_SET, &err);
		}

		OSTimeDlyHMSM(0, 0, 0, DELAY_TIME); // To run other tasks
	}
}
void i2c_multi_read(int Device_Addr, int Reg, int *pBuffer, int NumByteToRead)

{

	/* While the bus is busy */

