shimjaeyeong/H-TEC/Micrium/Software/EvalBoards/ST/STM3210B-EVAL/IAR/OS-Probe/app.c
	while (I2C_GetFlagStatus(((I2C_TypeDef *)I2C1_BASE), I2C_FLAG_BUSY))
		;

	/* Send START condition */

	I2C_GenerateSTART(((I2C_TypeDef *)I2C1_BASE), ENABLE);

	/* Test on EV5 and clear it */

	while (!I2C_CheckEvent(((I2C_TypeDef *)I2C1_BASE), I2C_EVENT_MASTER_MODE_SELECT))
		;

	/* Send slave address for write */

	I2C_Send7bitAddress(((I2C_TypeDef *)I2C1_BASE), Device_Addr, I2C_Direction_Transmitter);

	/* Test on EV6 and clear it */

	while (!I2C_CheckEvent(((I2C_TypeDef *)I2C1_BASE), I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED))
		;

	/* Send the device internal address to read from: Only one byte address */

	I2C_SendData(((I2C_TypeDef *)I2C1_BASE), Reg);

	/* Test on EV8 and clear it */

	while (!I2C_CheckEvent(((I2C_TypeDef *)I2C1_BASE), I2C_EVENT_MASTER_BYTE_TRANSMITTED))
		;

	/* Send STOP condition */

	I2C_GenerateSTOP(((I2C_TypeDef *)I2C1_BASE), ENABLE);

	/********************************/

	/* Send STRAT condition a second time */

	I2C_GenerateSTART(((I2C_TypeDef *)I2C1_BASE), ENABLE);

	/* Test on EV5 and clear it */

	while (!I2C_CheckEvent(((I2C_TypeDef *)I2C1_BASE), I2C_EVENT_MASTER_MODE_SELECT))
		;

	/* Send device address for read */

	I2C_Send7bitAddress(((I2C_TypeDef *)I2C1_BASE), Device_Addr, I2C_Direction_Receiver);

	/* Test on EV6 and clear it */

	while (!I2C_CheckEvent(((I2C_TypeDef *)I2C1_BASE), I2C_EVENT_MASTER_RECEIVER_MODE_SELECTED))
		;

	/* While there is data to be read */

	while (NumByteToRead)

	{

		if (NumByteToRead == 1)

		{

			/* Disable Acknowledgement */

			I2C_AcknowledgeConfig(((I2C_TypeDef *)I2C1_BASE), DISABLE);

			/* Send STOP Condition */

			I2C_GenerateSTOP(((I2C_TypeDef *)I2C1_BASE), ENABLE);
		}

		while ((I2C_GetLastEvent(((I2C_TypeDef *)I2C1_BASE)) & 0x0040) != 0x000040)
			; /* Poll on RxNE */

		/* Read a byte from the EEPROM */

		*pBuffer = I2C_ReceiveData(((I2C_TypeDef *)I2C1_BASE));

		/* Point to the next location where the byte read will be saved */

		pBuffer++;

		/* Decrement the read bytes counter */

		NumByteToRead--;
	}

	/* Enable Acknowledgement to be ready for another reception */

	I2C_AcknowledgeConfig(((I2C_TypeDef *)I2C1_BASE), ENABLE);
}

static int readTemperature()
{
	int state = 0;
	I2C_GenerateSTART(((I2C_TypeDef *)I2C1_BASE), ENABLE);
	I2C_Send7bitAddress(((I2C_TypeDef *)I2C1_BASE), 0x74, I2C_Direction_Transmitter);
	while (!I2C_CheckEvent(((I2C_TypeDef *)I2C1_BASE), I2C_EVENT_MASTER_TRANSMITTER_MODE_SELECTED))
		state = I2C_GetLastEvent(((I2C_TypeDef *)I2C1_BASE));

	I2C_SendData(((I2C_TypeDef *)I2C1_BASE), 0x07);
	while (!I2C_CheckEvent(((I2C_TypeDef *)I2C1_BASE), I2C_EVENT_MASTER_BYTE_TRANSMITTED))
		state = I2C_GetLastEvent(((I2C_TypeDef *)I2C1_BASE));
	//I2C_GenerateSTOP(((I2C_TypeDef *)I2C1_BASE), ENABLE); // check

	I2C_GenerateSTART(((I2C_TypeDef *)I2C1_BASE), ENABLE);
	//while (!I2C_CheckEvent(((I2C_TypeDef *)I2C1_BASE), I2C_EVENT_MASTER_MODE_SELECT))
	//	; // check
	//I2C_SendData(I2C1, 0x75);
	I2C_Send7bitAddress(((I2C_TypeDef *)I2C1_BASE), 0x75, I2C_Direction_Transmitter);
	while (!I2C_CheckEvent(((I2C_TypeDef *)I2C1_BASE), I2C_EVENT_MASTER_MODE_SELECT))
		state = I2C_GetLastEvent(((I2C_TypeDef *)I2C1_BASE));

	int low = I2C_ReceiveData(((I2C_TypeDef *)I2C1_BASE));
	I2C_AcknowledgeConfig(((I2C_TypeDef *)I2C1_BASE), ENABLE);

	int high = I2C_ReceiveData(((I2C_TypeDef *)I2C1_BASE));
	I2C_AcknowledgeConfig(((I2C_TypeDef *)I2C1_BASE), ENABLE);

	int pec = I2C_GetPEC(((I2C_TypeDef *)I2C1_BASE));
	I2C_GenerateSTOP(((I2C_TypeDef *)I2C1_BASE), ENABLE);

	if (high & 0x80 != 0)
	{
		return -1;
	}
	else
	{
		return (high << 8 + low) * 0.02 - 273.15;
	}
}

/*
 *********************************************************************************************************
 *                                            passTask()
 *
 * Description : Those who are at normal body temperature are allowed to pass.
 *
 * Argument(s) : p
 *
 * Return(s)   : none.
 *
 * Caller(s)   : This is a task.
 *
 * Note(s)     : none.
 *********************************************************************************************************
 */
// 정상체온인 사람은 통과를 허가하는 Task
static void passTask(void *p)
{
	int err;
	while (DEF_TRUE)
	{
		OSFlagPend(flagGroup, FLAG_DETECT + FLAG_TEMPER_NORMAL, OS_FLAG_WAIT_SET_ALL + OS_FLAG_CONSUME, 0, (INT8U *)&err);
		//GPIO_SetBits(GPIOC, GPIO_Pin_11);
		
		

		OSSemPend(sem, 0, (INT8U *)&err);
		if (count == 0)
		{
			count = 1;
		}
		OSSemPost(sem);
		OSTimeDlyHMSM(0, 0, 0, DELAY_TIME); // To run other tasks
	}
}

/*
 *********************************************************************************************************
 *                                            denyTask()
 *
 * Description : People with abnormal body temperature are not allowed to pass through.
 *
 * Argument(s) : p
 *
 * Return(s)   : none.
 *
 * Caller(s)   : This is a task.
 *
 * Note(s)     : none.
 *********************************************************************************************************
 */
// 비정상체온인 사람은 통과를 불허하는 Task
static void denyTask(void *p)
{
	int err;
	int temp = 0;
	while (DEF_TRUE)
	{
		int flags =
			OSFlagPend(flagGroup,
					   FLAG_TEMPER_HIGH + FLAG_TEMPER_LOW + FLAG_DETECT_NOT,
					   OS_FLAG_WAIT_SET_ANY + OS_FLAG_CONSUME,
					   0,
					   (INT8U *)&err);
		if ((flags & FLAG_TEMPER_HIGH) != 0 && (flags & FLAG_DETECT_NOT) == 0)
		{
			GPIO_SetBits(GPIOC, GPIO_Pin_10);
			// piezo
			GPIO_SetBits(GPIOB, GPIO_Pin_8);
		}
		else if ((flags & FLAG_TEMPER_LOW) != 0 && (flags & FLAG_DETECT_NOT) == 0)
		{
			GPIO_SetBits(GPIOC, GPIO_Pin_10);
			// piezo
			GPIO_SetBits(GPIOB, GPIO_Pin_8);
		}
		OSSemPend(sem, 0, (INT8U *)&err);
		if (count == 0)
			count = 1;
		OSSemPost(sem);
		OSTimeDlyHMSM(0, 0, 0, DELAY_TIME); // To run other tasks
	}
}

/*
 *********************************************************************************************************
 *                                            checkTask()
 *
 * Description : Check dot-matrix, piezo, motor.
 *
 * Argument(s) : p
 *
 * Return(s)   : none.
 *
 * Caller(s)   : This is a task.
 *
 * Note(s)     : none.
 *********************************************************************************************************
 */
// 경고를 일정 시간 후 정지하도록 하는 Task
static void checkTask(void *p)
{
	CPU_INT08U err;

	BSP_Init();
	OS_CPU_SysTickInit();
#if (OS_TASK_STAT_EN > 0)
	OSStatInit(); /* Determine CPU capacity.                              */
#endif

#if ((APP_PROBE_COM_EN == DEF_ENABLED) || \
	 (APP_OS_PROBE_EN == DEF_ENABLED))
	App_InitProbe();
#endif

	// Create Event Flag
	flagGroup = OSFlagCreate(0, &err);

